On my test:
```
terraform --version
Terraform v1.4.2
on darwin_arm64
+ provider registry.terraform.io/hashicorp/awscc v0.55.0
```

Result
```
Terraform used the selected providers to generate the following execution plan. Resource actions are
indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # awscc_ec2_launch_template.example will be created
  + resource "awscc_ec2_launch_template" "example" {
      + default_version_number = (known after apply)
      + id                     = (known after apply)
      + latest_version_number  = (known after apply)
      + launch_template_data   = {
          + block_device_mappings                = (known after apply)
          + capacity_reservation_specification   = (known after apply)
          + cpu_options                          = (known after apply)
          + credit_specification                 = (known after apply)
          + disable_api_stop                     = (known after apply)
          + disable_api_termination              = (known after apply)
          + ebs_optimized                        = (known after apply)
          + elastic_gpu_specifications           = (known after apply)
          + elastic_inference_accelerators       = (known after apply)
          + enclave_options                      = (known after apply)
          + hibernation_options                  = (known after apply)
          + iam_instance_profile                 = (known after apply)
          + image_id                             = "ami-0ff8a91507f77f867"
          + instance_initiated_shutdown_behavior = (known after apply)
          + instance_market_options              = (known after apply)
          + instance_requirements                = (known after apply)
          + instance_type                        = "t2.micro"
          + kernel_id                            = (known after apply)
          + key_name                             = (known after apply)
          + license_specifications               = (known after apply)
          + maintenance_options                  = (known after apply)
          + metadata_options                     = (known after apply)
          + monitoring                           = (known after apply)
          + network_interfaces                   = (known after apply)
          + placement                            = (known after apply)
          + private_dns_name_options             = (known after apply)
          + ram_disk_id                          = (known after apply)
          + security_group_ids                   = (known after apply)
          + security_groups                      = (known after apply)
          + tag_specifications                   = (known after apply)
          + user_data                            = (known after apply)
        }
      + launch_template_id     = (known after apply)
      + launch_template_name   = (known after apply)
      + tag_specifications     = (known after apply)
      + version_description    = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
awscc_ec2_launch_template.example: Creating...
awscc_ec2_launch_template.example: Creation complete after 7s [id=lt-09bfe5b1778077262]
```